{"do_lower_case": false, "unk_token": "[UNK]", "sep_token": "[SEP]", "pad_token": "[PAD]", "cls_token": "[CLS]", "mask_token": "[MASK]", "tokenize_chinese_chars": true, "strip_accents": null, "max_len": 512, "do_basic_tokenize": true, "never_split": ["+وا", "س+", "[مستخدم]", "+ك", "+هم", "+ة", "+ن", "لل+", "[بريد]", "[رابط]", "+ه", "+كن", "+ا", "+ات", "+ي", "ب+", "+نا", "+هن", "+كم", "ك+", "+ين", "+هما", "و+", "+كما", "+ان", "+ت", "+ون", "ل+", "+ها", "ال+", "ف+"], "special_tokens_map_file": null, "full_tokenizer_file": null, "name_or_path": "aubmindlab/bert-base-arabert"}